nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f80000evk/demo_apps/mc_pmsm/pmsm_snsless/peripherals.c
#if defined(PIT0_MOD_L_INIT) && defined(PIT0_MOD_H_INIT)
    PIT0->MOD_L = PIT0_MOD_L_INIT;
    PIT0->MOD_H = PIT0_MOD_H_INIT;
#endif
#if defined(PIT0_MOD_INIT)
    PIT0->MOD = PIT0_MOD_INIT;
#endif
#if defined(PIT0_FILT_INIT)
    PIT0->FILT = PIT0_FILT_INIT;
#endif
#if defined(PIT0_CTRL2_INIT)
    PIT0->CTRL2 = PIT0_CTRL2_INIT;
#endif
#if defined(PIT0_CTRL_INIT)
#if ((PIT0_CTRL_INIT & PIT_CTRL_CNT_EN_MASK) != 0)
    PIT0->CTRL = (PIT0_CTRL_INIT & (~PIT_CTRL_CNT_EN_MASK));
    PIT0->CTRL |= PIT_CTRL_CNT_EN_MASK;
#else
    PIT0->CTRL = PIT0_CTRL_INIT;
#endif
#endif
}

/***********************************************************************************************************************
 * CMPC initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'CMPC'
- type: 'cmp_reg'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'cmp_reg_3fe3364eca8ece52bd212873a03681c2'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'CMPC'
- config_sets:
  - fsl_filter:
    - filter_config:
      - clockSource: 'SystemClock'
      - clockSourceFreq: 'BOARD_BootClockRUN'
      - filterPeriod: '1'
      - filterCount2: '1'
  - fsl_cmp:
    - main_config:
      - explicitEnableCmp: 'true'
      - filterModes: 'm0'
      - hysteresisMode: 'kCMP_HysteresisLevel0'
      - enableHighSpeed: 'true'
      - enableInvertOutput: 'false'
      - useUnfilteredOutput: 'false'
      - enablePinOut: 'false'
    - positiveChannel: 'IN.3'
    - negativeChannel: 'IN.7'
  - fsl_dac:
    - enableDAC: 'true'
    - dac_config:
      - referenceVoltageSource: 'DAC_8bit_VIN1'
      - DACValue: '192'
  - interrupt:
    - interrupt_sel: ''
    - enableDma: 'false'
    - enable_irq: 'false'
    - interrupt:
      - IRQn: 'kCMPC_VECTORn'
      - dsc_enable_interrrupt: 'iprVal3'
      - enable_custom_name: 'false'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void CMPC_init(void) {
  /* Software reset the CMPC. */
  CMPC->CR0   = 0U;
  CMPC->CR1   = 0U;
  CMPC->FPR   = 0U;
  CMPC->SCR   = 0U;
  CMPC->DACCR = 0U;
  CMPC->MUXCR = 0U;
#if defined(CMPC_CR0_INIT)
  CMPC->CR0 = CMPC_CR0_INIT;
#endif /* CMPC_CR0_INIT */
#if defined(CMPC_FPR_INIT)
  CMPC->FPR = CMPC_FPR_INIT;
#endif /* CMPC_FPR_INIT */
#if defined(CMPC_SCR_INIT)
  CMPC->SCR = CMPC_SCR_INIT;
#endif /* CMPC_SCR_INIT */
#if defined(CMPC_DACCR_INIT)
  CMPC->DACCR = CMPC_DACCR_INIT;
#endif /* CMPC_DACCR_INIT */
#if defined(CMPC_MUXCR_INIT)
  CMPC->MUXCR = CMPC_MUXCR_INIT;
#endif /* CMPC_MUXCR_INIT */
#if defined(CMPC_CR1_INIT)
  CMPC->CR1 = CMPC_CR1_INIT;
#endif /* CMPC_CR1_INIT */
}

/***********************************************************************************************************************
 * ADC initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'ADC'
- type: 'cadc_reg'
- mode: 'CADC'
- custom_name_enabled: 'false'
- type_id: 'cadc_reg_3aa3a1e7f4a7b23ac90f68072daac258'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'ADC'
- config_sets:
  - fsl_cadc:
    - cadcConfig:
      - clockSource: 'BusInterfaceClock'
      - clockSourceFreq: 'BOARD_BootClockRUN'
      - dualConverterScanMode: 'kCADC_DualConverterWorkAsTriggeredParallel'
      - enableSimultaneousMode: 'true'
      - DMATriggerSource: 'kCADC_DMATriggerSourceAsEndOfScan'
      - powerUpDelay: '26'
      - autoPowerDown: 'false'
      - clockDivisorInt: '8'
      - enableDMA0: 'false'
      - enableStop0: 'false'
      - startConversion0: 'false'
      - enableSYNC0: 'true'
      - manualPowerDownA: 'false'
      - highReferenceA: 'vdda'
      - lowReferenceA: 'vssa'
      - onChipAnalogInputA: 'normal'
      - tempSensorA: 'normal'
      - expansion_config_a:
        - scanControl: '0'
        - resetMuxScan: 'false'
        - mux_aux_expansion_array:
          - 0:
            - sampleName: 'Sample_ExpA_0'
            - channelNumberEnum: 'ANA.40'
            - stop_scan: 'false'
            - aux: '0'
          - 1:
            - sampleName: 'Sample_ExpA_1'
            - channelNumberEnum: 'ANA.40'
            - stop_scan: 'false'
            - aux: '0'
          - 2:
            - sampleName: 'Sample_ExpA_2'
            - channelNumberEnum: 'ANA.40'
            - stop_scan: 'false'
            - aux: '0'
          - 3:
            - sampleName: 'Sample_ExpA_3'
            - channelNumberEnum: 'ANA.40'
            - stop_scan: 'false'
            - aux: '0'
          - 4:
            - sampleName: 'Sample_ExpA_4'
            - channelNumberEnum: 'ANA.40'
            - stop_scan: 'false'
            - aux: '0'
          - 5:
            - sampleName: 'Sample_ExpA_5'
            - channelNumberEnum: 'ANA.40'
            - stop_scan: 'false'
            - aux: '0'
          - 6:
            - sampleName: 'Sample_ExpA_6'
            - channelNumberEnum: 'ANA.40'
            - stop_scan: 'false'
            - aux: '0'
          - 7:
            - sampleName: 'Sample_ExpA_7'
            - channelNumberEnum: 'ANA.40'
            - stop_scan: 'false'
            - aux: '0'
      - manualPowerDownB: 'false'
      - highReferenceB: 'vdda'
      - lowReferenceB: 'vssa'
      - onChipAnalogInputB: 'normal'
      - tempSensorB: 'normal'
      - expansion_config_b:
        - scanControl: '0'
        - resetMuxScan: 'false'
        - mux_aux_expansion_array:
          - 0:
            - sampleName: 'Sample_ExpB_0'
            - channelNumberEnum: 'ANB.40'
            - stop_scan: 'false'
            - aux: '0'
          - 1:
            - sampleName: 'Sample_ExpB_1'
            - channelNumberEnum: 'ANB.40'
            - stop_scan: 'false'
            - aux: '0'
          - 2:
            - sampleName: 'Sample_ExpB_2'
            - channelNumberEnum: 'ANB.40'
            - stop_scan: 'false'
            - aux: '0'
          - 3:
            - sampleName: 'Sample_ExpB_3'
            - channelNumberEnum: 'ANB.40'
            - stop_scan: 'false'
            - aux: '0'
          - 4:
            - sampleName: 'Sample_ExpB_4'
            - channelNumberEnum: 'ANB.40'
            - stop_scan: 'false'
            - aux: '0'
          - 5:
            - sampleName: 'Sample_ExpB_5'
            - channelNumberEnum: 'ANB.40'
            - stop_scan: 'false'
            - aux: '0'
          - 6:
            - sampleName: 'Sample_ExpB_6'
            - channelNumberEnum: 'ANB.40'
            - stop_scan: 'false'
            - aux: '0'
          - 7:
            - sampleName: 'Sample_ExpB_7'
            - channelNumberEnum: 'ANB.40'
            - stop_scan: 'false'
            - aux: '0'
    - channelConfig:
      - 0:
        - chMode: '0'
      - 1:
        - chMode: '0'
      - 2:
        - chMode: '0'
      - 3:
        - chMode: '0'
      - 4:
        - chMode: '0'
      - 5:
        - chMode: '0'
      - 6:
        - chMode: '0'
      - 7:
        - chMode: '0'
    - inputGainConfig:
      - channels_inputGain_convA:
        - 0:
          - channelGain: '0'
        - 1:
          - channelGain: '0'
        - 2:
          - channelGain: '0'
        - 3:
          - channelGain: '0'
        - 4:
          - channelGain: '0'
        - 5:
          - channelGain: '0'
        - 6:
          - channelGain: '0'
        - 7:
          - channelGain: '0'
        - 8:
          - channelGain: '0'
        - 9:
          - channelGain: '0'
      - channels_inputGain_convB:
        - 0:
          - channelGain: '0'
        - 1:
          - channelGain: '0'
        - 2:
          - channelGain: '0'
        - 3:
          - channelGain: '0'
        - 4:
          - channelGain: '0'
        - 5:
          - channelGain: '0'
        - 6:
          - channelGain: '0'
        - 7:
          - channelGain: '0'
        - 8:
          - channelGain: '0'
        - 9:
          - channelGain: '0'
    - channels_config:
      - 0:
        - sampleName: 'Sample_0'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.0'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 1:
        - sampleName: 'Sample_1'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.1'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 2:
        - sampleName: 'Sample_2'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.2'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 3:
        - sampleName: 'Sample_3'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.3'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 4:
        - sampleName: 'Sample_4'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.4'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 5:
        - sampleName: 'Sample_5'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.5'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 6:
        - sampleName: 'Sample_6'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.6'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 7:
        - sampleName: 'Sample_7'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.7'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 8:
        - sampleName: 'Sample_8'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.0'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 9:
        - sampleName: 'Sample_9'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.1'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 10:
        - sampleName: 'Sample_10'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.2'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 11:
        - sampleName: 'Sample_11'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.3'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 12:
        - sampleName: 'Sample_12'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.4'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 13:
        - sampleName: 'Sample_13'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.5'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 14:
        - sampleName: 'Sample_14'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.6'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 15:
        - sampleName: 'Sample_15'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.7'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 16:
        - sampleName: 'Sample_16'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.8'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 17:
        - sampleName: 'Sample_17'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.9'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 18:
        - sampleName: 'Sample_18'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.8'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 19:
        - sampleName: 'Sample_19'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.9'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
    - channels_config_A_parallel:
      - 0:
        - sampleName: 'Sample_0'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.0'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 1:
        - sampleName: 'Sample_1'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.2'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 2:
        - sampleName: 'Sample_2'
        - disableSample: 'true'
        - channelNumberEnum: 'ANA.1'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 3:
        - sampleName: 'Sample_3'
        - disableSample: 'true'
        - channelNumberEnum: 'ANA.3'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 4:
        - sampleName: 'Sample_4'
        - disableSample: 'true'
        - channelNumberEnum: 'ANA.4'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 5:
        - sampleName: 'Sample_5'
        - disableSample: 'true'
        - channelNumberEnum: 'ANA.5'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 6:
        - sampleName: 'Sample_6'
        - disableSample: 'true'
        - channelNumberEnum: 'ANA.6'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 7:
        - sampleName: 'Sample_7'
        - disableSample: 'true'
        - channelNumberEnum: 'ANA.7'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 8:
        - sampleName: 'Sample_16'
        - disableSample: 'true'
        - channelNumberEnum: 'ANA.8'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 9:
        - sampleName: 'Sample_17'
        - disableSample: 'true'
        - channelNumberEnum: 'ANA.9'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
    - channels_config_B_parallel:
      - 0:
        - sampleName: 'Sample_8'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.0'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 1:
        - sampleName: 'Sample_9'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.3'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 2:
        - sampleName: 'Sample_10'
        - disableSample: 'true'
        - channelNumberEnum: 'ANB.2'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 3:
        - sampleName: 'Sample_11'
        - disableSample: 'true'
        - channelNumberEnum: 'ANB.3'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 4:
        - sampleName: 'Sample_12'
        - disableSample: 'true'
        - channelNumberEnum: 'ANB.4'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 5:
        - sampleName: 'Sample_13'
        - disableSample: 'true'
        - channelNumberEnum: 'ANB.5'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 6:
        - sampleName: 'Sample_14'
        - disableSample: 'true'
        - channelNumberEnum: 'ANB.6'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 7:
        - sampleName: 'Sample_15'
        - disableSample: 'true'
        - channelNumberEnum: 'ANB.7'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 8:
        - sampleName: 'Sample_18'
        - disableSample: 'true'
        - channelNumberEnum: 'ANB.8'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 9:
        - sampleName: 'Sample_19'
        - disableSample: 'true'
        - channelNumberEnum: 'ANB.9'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
    - interrupt:
      - interruptSources: 'kCADC_ConverterAEndOfScanInterruptEnable'
      - enable_err_irq: 'false'
      - interrupt_err:
        - IRQn: 'kADC_ERR_VECTORn'
        - dsc_enable_interrrupt: 'iprVal0'
        - enable_custom_name: 'false'
      - enable_cc0_irq: 'true'
      - interrupt_cc0:
        - IRQn: 'kADC_CC0_VECTORn'
        - dsc_enable_interrrupt: 'iprVal3'
        - enable_custom_name: 'false'
      - enable_cc1_irq: 'false'
      - interrupt_cc1:
        - IRQn: 'kADC_CC1_VECTORn'
        - dsc_enable_interrrupt: 'iprVal0'
        - enable_custom_name: 'false'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

