nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f80000evk/demo_apps/mc_pmsm/pmsm_snsless/peripherals.c
/***********************************************************************************************************************
 * TMRA initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'TMRA'
- type: 'qtmr_reg'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'qtmr_reg_19ff29c7d66f72ec59fde9c83852e6f9'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'TMRA'
- config_sets:
  - generalConfig:
    - clockSource: 'BusInterfaceClock'
    - clockSourceFreq: 'BOARD_BootClockRUN'
    - enable_timer_channels:
      - 0:
        - enableTimerChannel: 'true'
      - 1:
        - enableTimerChannel: 'false'
      - 2:
        - enableTimerChannel: 'false'
      - 3:
        - enableTimerChannel: 'false'
    - input_filters:
      - 0:
        - inputFilterPeriod: '0'
        - inputFilterCount: '3'
      - 1:
        - inputFilterPeriod: '0'
        - inputFilterCount: '3'
      - 2:
        - inputFilterPeriod: '0'
        - inputFilterCount: '3'
      - 3:
        - inputFilterPeriod: '0'
        - inputFilterCount: '3'
    - qtmr_channels:
      - 0:
        - channel: '0'
        - channelConfig:
          - primarySource: '8'
          - secondarySource: '0'
          - inputPolarity: 'false'
          - inputFault: 'false'
          - countingMode: '1'
          - enableCountOnce: 'false'
          - countLength: '0'
          - inputAltLoad: 'false'
          - countDirection: '0'
          - triggeredCountInit: '0'
          - enableMasterMode: 'false'
          - enableExternalForce: 'false'
          - enableCoChannelReinit: 'false'
          - outputMode: '0'
          - forceOutputValue: 'false'
          - forcedOutputValue: '0'
          - outputPolarity: 'false'
          - outputEnabled: 'false'
          - captureMode: '0'
          - reloadOnCapture: 'false'
          - compare1Period: '0'
          - compareLoadControl1: '0'
          - compare2Period: '0'
          - compareLoadControl2: '0'
          - compareLoad1: '0'
          - compareLoad2: '0'
          - counterLoad: '0'
          - counterInit: '0'
          - debugMode: '0'
          - interruptSources:
            - kQTMR_CompareInterruptEnable: 'false'
            - kQTMR_Compare1InterruptEnable: 'false'
            - kQTMR_Compare2InterruptEnable: 'false'
            - kQTMR_OverflowInterruptEnable: 'false'
            - kQTMR_EdgeInterruptEnable: 'false'
          - enable_irq: 'false'
          - interrupt:
            - IRQn: 'kTMRA_0_VECTORn'
            - dsc_enable_interrrupt: 'iprVal0'
            - enable_custom_name: 'false'
          - dma:
            - kQTMR_InputEdgeFlagDmaEnable: 'false'
            - kQTMR_ComparatorPreload1DmaEnable: 'false'
            - kQTMR_ComparatorPreload2DmaEnable: 'false'
        - template_params: []
    - qtmr_params: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void TMRA_init(void) {
/****************************************************************************/
/* Channel 0 initialization */
/****************************************************************************/
  /* Disable the channel before the module init*/
  TMRA->CHANNEL[0].ENBL &= ~(TMR_ENBL_ENBL(1U << 0));
  TMRA->CHANNEL[0].HOLD = 0x0U;
  TMRA->CHANNEL[0].CAPT = 0x0U;
#ifdef TMRA_COMP10_INIT
  TMRA->CHANNEL[0].COMP1 = TMRA_COMP10_INIT;
#else
  TMRA->CHANNEL[0].COMP1 = 0x0U;
#endif /*TMRA_COMP10_INIT*/
#ifdef TMRA_COMP20_INIT
  TMRA->CHANNEL[0].COMP2 = TMRA_COMP20_INIT;
#else
  TMRA->CHANNEL[0].COMP2 = 0x0U;
#endif /*TMRA_COMP20_INIT */
#ifdef TMRA_LOAD0_INIT
  TMRA->CHANNEL[0].LOAD = TMRA_LOAD0_INIT;
#else
  TMRA->CHANNEL[0].LOAD = 0x0U;
#endif /*TMRA_LOAD0_INIT */
#ifdef TMRA_CNTR0_INIT
  TMRA->CHANNEL[0].CNTR = TMRA_CNTR0_INIT;
#else
  TMRA->CHANNEL[0].CNTR = 0x0U;
#endif /*TMRA_CNTR0_INIT */
#ifdef TMRA_SCTRL0_INIT
  TMRA->CHANNEL[0].SCTRL = TMRA_SCTRL0_INIT;
#else
  TMRA->CHANNEL[0].SCTRL = 0x0U;
#endif /*TMRA_SCTRL0_INIT */
#ifdef TMRA_CMPLD10_INIT
  TMRA->CHANNEL[0].CMPLD1 = TMRA_CMPLD10_INIT;
#else
  TMRA->CHANNEL[0].CMPLD1 = 0x0U;
#endif /*TMRA_CMPLD10_INIT */
#ifdef TMRA_CMPLD20_INIT
  TMRA->CHANNEL[0].CMPLD2 = TMRA_CMPLD20_INIT;
#else
  TMRA->CHANNEL[0].CMPLD2 = 0x0U;
#endif /*TMRA_CMPLD20_INIT */
#ifdef TMRA_CSCTRL0_INIT
  TMRA->CHANNEL[0].CSCTRL = TMRA_CSCTRL0_INIT;
#else
  TMRA->CHANNEL[0].CSCTRL = 0x0U;
#endif /*TMRA_CSCTRL0_INIT */
#ifdef TMRA_DMA0_INIT
  TMRA->CHANNEL[0].DMA = TMRA_DMA0_INIT;
#else
  TMRA->CHANNEL[0].DMA = 0x0U;
#endif /*TMRA_DMA0_INIT */
#ifdef TMRA_CTRL0_INIT
  TMRA->CHANNEL[0].CTRL = TMRA_CTRL0_INIT;
#else
  TMRA->CHANNEL[0].CTRL = 0x0U;
#endif /*TMRA_CTRL0_INIT */
/****************************************************************************/
/* Quad timer global initialization */
/****************************************************************************/
  /* Input filters configuration */
#ifdef TMRA_FILT0_INIT
  TMRA->CHANNEL[0].FILT = TMRA_FILT0_INIT;
#else
  TMRA->CHANNEL[0].FILT = 0x0U;
#endif /*TMRA_FILT0_INIT */
#ifdef TMRA_FILT1_INIT
  TMRA->CHANNEL[1].FILT = TMRA_FILT1_INIT;
#else
  TMRA->CHANNEL[1].FILT = 0x0U;
#endif /*TMRA_FILT1_INIT */
#ifdef TMRA_FILT2_INIT
  TMRA->CHANNEL[2].FILT = TMRA_FILT2_INIT;
#else
  TMRA->CHANNEL[2].FILT = 0x0U;
#endif /*TMRA_FILT2_INIT */
#ifdef TMRA_FILT3_INIT
  TMRA->CHANNEL[3].FILT = TMRA_FILT3_INIT;
#else
  TMRA->CHANNEL[3].FILT = 0x0U;
#endif /*TMRA_FILT3_INIT */
  /* Synchronous start of all channels */
#if defined(TMRA_ENBL_INIT)
   TMRA->CHANNEL[0].ENBL = (TMRA->CHANNEL[0].ENBL & (~TMRA_ENBL_INIT_MASK)) | (TMRA_ENBL_INIT & TMRA_ENBL_INIT_MASK);
#endif /*TMRA_TMRA_ENBL_INIT */
}

/***********************************************************************************************************************
 * PWMA initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'PWMA'
- type: 'pwm_reg'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'pwm_reg_d49946f7b366f6b63d56e6e76fd333cc'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'PWMA'
- config_sets:
  - fsl_pwm:
    - clockSource: 'SystemClock'
    - clockSourceFreq: 'ClocksTool_DefaultInit'
    - pllMonitor: '0'
    - stretch_count: '0'
    - submodules:
      - 0:
        - sm: 'kPWM_Module_0'
        - sm_template_params: []
        - config:
          - clockSource: 'kPWM_BusClock'
          - prescale: '0'
          - compareMode: '0'
          - loadOK: 'true'
          - startCounter: 'false'
          - signed_unsigned: 'signed'
          - init: '-5000'
          - val1: '4999'
          - fracval1: '0'
          - val0: '0'
          - val2: '-2500'
          - fracval2: '0'
          - val3: '2500'
          - fracval3: '0'
          - val4: '-4980'
          - fracval4: '0'
          - val5: '0'
          - fracval5: '0'
          - initializationControl: '0'
          - enableDebugMode: 'false'
          - enableWait: 'false'
          - pairOperation: '0'
          - pairMain: '0'
          - deadtime_logic_inputs:
            - pwm23:
              - deadtime_input_by_force: '0'
              - SW_value: '0'
            - pwm45:
              - deadtime_input_by_force: '0'
              - SW_value: '0'
          - deadtime_params:
            - deadTime0:
              - clockSource: 'kPWM_BusClock'
              - deadtimeValue: '50'
            - deadTime1:
              - clockSource: 'kPWM_BusClock'
              - deadtimeValue: '50'
          - reloadControl:
            - reloadImmediate: 'false'
            - reloadLogic: 'kPWM_ReloadPwmFullCycle'
            - reloadSelect: '0'
            - reloadFrequency: '0'
          - forceControl:
            - forceTrigger: '0'
            - pwm23Init: '0'
            - pwm45Init: '0'
            - pwmxInit: '0'
            - forceEn: 'false'
          - fracControl:
            - fracEn: ''
            - powerUp: 'false'
          - doubleSwitching:
            - doubleEn: 'false'
            - doubleX: 'false'
            - split: '0'
          - outputEn: ''
          - outputMask: ''
          - maskImmediately: 'false'
          - outputTrigger_sel: 'kPWM_ValueRegister_4'
          - triggerFrequency: '0'
          - interrupt_sel: ''
          - interrupt_flags: ''
          - dma_used: 'false'
          - dma:
            - pwmDMA_activate: 'false'
            - captureDMA_enable: ''
            - captureDMA_source: '0'
            - captureDMA_watermark_control: '0'
        - channels:
          - 0:
            - functionSel: 'pwmOutput'
            - pwm:
              - level: '0'
              - fault_channel0:
                - dismap: 's0'
              - fault_channel1:
                - dismap: ''
              - faultState: '0'
          - 1:
            - functionSel: 'pwmOutput'
            - pwm:
              - level: '0'
              - fault_channel0:
                - dismap: 's0'
              - fault_channel1:
                - dismap: ''
              - faultState: '0'
          - 2:
            - functionSel: 'notUsed'
        - compare_interruptEn: 'false'
        - compare_interrupt:
          - IRQn: 'keFlexPWMA_CMP0_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
        - reload_interruptEn: 'false'
        - reload_interrupt:
          - IRQn: 'keFlexPWMA_RELOAD0_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
      - 1:
        - sm: 'kPWM_Module_1'
        - sm_template_params: []
        - config:
          - clockSource: 'kPWM_Submodule0Clock'
          - prescale: '0'
          - compareMode: '0'
          - loadOK: 'true'
          - startCounter: 'false'
          - signed_unsigned: 'signed'
          - init: '-5000'
          - val1: '4999'
          - fracval1: '0'
          - val0: '0'
          - val2: '-2500'
          - fracval2: '0'
          - val3: '2500'
          - fracval3: '0'
          - val4: '0'
          - fracval4: '0'
          - val5: '0'
          - fracval5: '0'
          - initializationControl: '2'
          - phaseDly: '0'
          - enableDebugMode: 'false'
          - enableWait: 'false'
          - pairOperation: '0'
          - pairMain: '0'
          - deadtime_logic_inputs:
            - pwm23:
              - deadtime_input_by_force: '0'
              - SW_value: '0'
            - pwm45:
              - deadtime_input_by_force: '0'
              - SW_value: '0'
          - deadtime_params:
            - deadTime0:
              - clockSource: 'kPWM_BusClock'
              - deadtimeValue: '50'
            - deadTime1:
              - clockSource: 'kPWM_BusClock'
              - deadtimeValue: '50'
          - reloadControl:
            - reloadImmediate: 'false'
            - reloadLogic: 'kPWM_ReloadPwmFullCycle'
            - reloadSelect: '1'
            - reloadFrequency: '0'
          - forceControl:
            - forceTrigger: '0'
            - pwm23Init: '0'
            - pwm45Init: '0'
            - pwmxInit: '0'
            - forceEn: 'false'
          - fracControl:
            - fracEn: ''
            - powerUp: 'false'
          - doubleSwitching:
            - doubleEn: 'false'
            - doubleX: 'false'
            - split: '0'
          - outputEn: ''
          - outputMask: ''
          - maskImmediately: 'false'
          - outputTrigger_sel: ''
          - triggerFrequency: '0'
          - interrupt_sel: ''
          - interrupt_flags: ''
          - dma_used: 'false'
          - dma:
            - pwmDMA_activate: 'false'
            - captureDMA_enable: ''
            - captureDMA_source: '0'
            - captureDMA_watermark_control: '0'
        - channels:
          - 0:
            - functionSel: 'pwmOutput'
            - pwm:
              - level: '0'
              - fault_channel0:
                - dismap: 's0'
              - fault_channel1:
                - dismap: ''
              - faultState: '0'
          - 1:
            - functionSel: 'pwmOutput'
            - pwm:
              - level: '0'
              - fault_channel0:
                - dismap: 's0'
              - fault_channel1:
                - dismap: ''
              - faultState: '0'
          - 2:
            - functionSel: 'notUsed'
        - compare_interruptEn: 'false'
        - compare_interrupt:
          - IRQn: 'keFlexPWMA_CMP1_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
        - reload_interruptEn: 'false'
        - reload_interrupt:
          - IRQn: 'keFlexPWMA_RELOAD1_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
      - 2:
        - sm: 'kPWM_Module_2'
        - sm_template_params: []
        - config:
          - clockSource: 'kPWM_Submodule0Clock'
          - prescale: '0'
          - compareMode: '0'
          - loadOK: 'true'
          - startCounter: 'false'
          - signed_unsigned: 'signed'
          - init: '-5000'
          - val1: '4999'
          - fracval1: '0'
          - val0: '0'
          - val2: '-2500'
          - fracval2: '0'
          - val3: '2500'
          - fracval3: '0'
          - val4: '0'
          - fracval4: '0'
          - val5: '0'
          - fracval5: '0'
          - initializationControl: '2'
          - phaseDly: '0'
          - enableDebugMode: 'false'
          - enableWait: 'false'
          - pairOperation: '0'
          - pairMain: '0'
          - deadtime_logic_inputs:
            - pwm23:
              - deadtime_input_by_force: '0'
              - SW_value: '0'
            - pwm45:
              - deadtime_input_by_force: '0'
              - SW_value: '0'
          - deadtime_params:
            - deadTime0:
              - clockSource: 'kPWM_BusClock'
              - deadtimeValue: '50'
            - deadTime1:
              - clockSource: 'kPWM_BusClock'
              - deadtimeValue: '50'
          - reloadControl:
            - reloadImmediate: 'false'
            - reloadLogic: 'kPWM_ReloadPwmFullCycle'
            - reloadSelect: '1'
            - reloadFrequency: '0'
          - forceControl:
            - forceTrigger: '0'
            - pwm23Init: '0'
            - pwm45Init: '0'
            - pwmxInit: '0'
            - forceEn: 'false'
          - fracControl:
            - fracEn: ''
            - powerUp: 'false'
          - doubleSwitching:
            - doubleEn: 'false'
            - doubleX: 'false'
            - split: '0'
          - outputEn: ''
          - outputMask: ''
          - maskImmediately: 'false'
          - outputTrigger_sel: ''
          - triggerFrequency: '0'
          - interrupt_sel: ''
          - interrupt_flags: ''
          - dma_used: 'false'
          - dma:
            - pwmDMA_activate: 'false'
            - captureDMA_enable: ''
            - captureDMA_source: '0'
            - captureDMA_watermark_control: '0'
        - channels:
          - 0:
            - functionSel: 'pwmOutput'
            - pwm:
              - level: '0'
              - fault_channel0:
                - dismap: 's0'
              - fault_channel1:
                - dismap: ''
              - faultState: '0'
          - 1:
            - functionSel: 'pwmOutput'
            - pwm:
              - level: '0'
              - fault_channel0:
                - dismap: 's0'
              - fault_channel1:
                - dismap: ''
              - faultState: '0'
          - 2:
            - functionSel: 'notUsed'
        - compare_interruptEn: 'false'
        - compare_interrupt:
          - IRQn: 'keFlexPWMA_CMP2_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
        - reload_interruptEn: 'false'
        - reload_interrupt:
          - IRQn: 'keFlexPWMA_RELOAD2_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
    - faultChannels:
      - 0:
        - commonFaultSetting:
          - clockSource: 'kPWM_BusClock'
          - faultFilterPeriod: '20'
          - faultFilterCount: '10'
          - faultGlitchStretch: 'false'
          - testFault: 'false'
        - faults:
          - 0:
            - faultClearingMode: 'kPWM_Automatic'
            - faultLevelR: '1'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_RecoverFullCycle'
            - fault_int_source: 'false'
          - 1:
            - faultClearingMode: 'kPWM_ManualNormal'
            - faultLevelR: '0'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_NoRecovery'
            - fault_int_source: 'false'
          - 2:
            - faultClearingMode: 'kPWM_ManualNormal'
            - faultLevelR: '0'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_NoRecovery'
            - fault_int_source: 'false'
          - 3:
            - faultClearingMode: 'kPWM_ManualNormal'
            - faultLevelR: '0'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_NoRecovery'
            - fault_int_source: 'false'
        - fault_template_params: []
      - 1:
        - commonFaultSetting:
          - clockSource: 'kPWM_BusClock'
          - faultFilterPeriod: '0'
          - faultFilterCount: '3'
          - faultGlitchStretch: 'false'
          - testFault: 'false'
        - faults:
          - 0:
            - faultClearingMode: 'kPWM_ManualNormal'
            - faultLevelR: '0'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_NoRecovery'
            - fault_int_source: 'false'
          - 1:
            - faultClearingMode: 'kPWM_ManualNormal'
            - faultLevelR: '0'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_NoRecovery'
            - fault_int_source: 'false'
          - 2:
            - faultClearingMode: 'kPWM_ManualNormal'
            - faultLevelR: '0'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_NoRecovery'
            - fault_int_source: 'false'
          - 3:
            - faultClearingMode: 'kPWM_ManualNormal'
            - faultLevelR: '0'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_NoRecovery'
            - fault_int_source: 'false'
        - fault_template_params: []
    - capture_interruptEn: 'false'
    - capture_interrupt:
      - IRQn: 'keFlexPWMA_CAP_VECTORn'
      - dsc_enable_interrrupt: 'iprVal0'
      - enable_custom_name: 'false'
    - fault_interruptEn: 'false'
    - fault_interrupt:
      - IRQn: 'keFlexPWMA_FAULT_VECTORn'
      - dsc_enable_interrrupt: 'iprVal0'
      - enable_custom_name: 'false'
    - error_interruptEn: 'false'
    - error_interrupt:
      - IRQn: 'keFlexPWMA_RERR_VECTORn'
      - dsc_enable_interrrupt: 'iprVal0'
      - enable_custom_name: 'false'
    - pwm_common_template_params: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

