nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f80000evk/demo_apps/mc_pmsm/pmsm_snsless/peripherals.c
static void PWMA_init(void) {
/****************************************************************************/
/* Submodule 1 initialization */
/****************************************************************************/
  /* Disable the submodule and its output before the submodule init. */
  PWMA->OUTEN &= ~(PWM_OUTEN_PWMA_EN(1U << 1) | PWM_OUTEN_PWMB_EN(1U << 1) | PWM_OUTEN_PWMX_EN(1U << 1));
  PWMA->MCTRL &= ~(PWM_MCTRL_RUN(1U << 1) | PWM_MCTRL_CLDOK(1U << 1));
#ifdef PWMA_SM1CTRL_INIT
  PWMA->SM[1].CTRL = PWMA_SM1CTRL_INIT;
#else
  PWMA->SM[1].CTRL = 0x400U;
#endif /* PWMA_SM1CTRL_INIT */
#ifdef PWMA_SM1CTRL2_INIT
  PWMA->SM[1].CTRL2 = PWMA_SM1CTRL2_INIT;
#else
  PWMA->SM[1].CTRL2 = 0x0U;
#endif /* PWMA_SM1CTRL2_INIT */
#ifdef PWMA_SM1INIT_INIT
  PWMA->SM[1].INIT = PWMA_SM1INIT_INIT;
#else
  PWMA->SM[1].INIT = 0x0U;
#endif /* PWMA_SM1INIT_INIT */
#ifdef PWMA_SM1VAL0_INIT
  PWMA->SM[1].VAL0 = PWMA_SM1VAL0_INIT;
#else
  PWMA->SM[1].VAL0 = 0x0U;
#endif /* PWMA_SM1VAL0_INIT */
#ifdef PWMA_SM1VAL1_INIT
  PWMA->SM[1].VAL1 = PWMA_SM1VAL1_INIT;
#else
  PWMA->SM[1].VAL1 = 0x0U;
#endif /* PWMA_SM1VAL1_INIT */
#ifdef PWMA_SM1VAL2_INIT
  PWMA->SM[1].VAL2 = PWMA_SM1VAL2_INIT;
#else
  PWMA->SM[1].VAL2 = 0x0U;
#endif /* PWMA_SM1VAL2_INIT */
#ifdef PWMA_SM1VAL3_INIT
  PWMA->SM[1].VAL3 = PWMA_SM1VAL3_INIT;
#else
  PWMA->SM[1].VAL3 = 0x0U;
#endif /* PWMA_SM1VAL3_INIT */
#ifdef PWMA_SM1VAL4_INIT
  PWMA->SM[1].VAL4 = PWMA_SM1VAL4_INIT;
#else
  PWMA->SM[1].VAL4 = 0x0U;
#endif /* PWMA_SM1VAL4_INIT */
#ifdef PWMA_SM1VAL5_INIT
  PWMA->SM[1].VAL5 = PWMA_SM1VAL5_INIT;
#else
  PWMA->SM[1].VAL5 = 0x0U;
#endif /* PWMA_SM1VAL5_INIT */
#if (defined(PWMA_SM1_FRACTIONAL_BLOCK_AVAILABLE))
#ifdef PWMA_SM1FRACVAL1_INIT
  PWMA->SM[1].FRACVAL1 = PWMA_SM1FRACVAL1_INIT;
#else
  PWMA->SM[1].FRACVAL1 = 0x0U;
#endif /* PWMA_SM1FRACVAL1_INIT */
#ifdef PWMA_SM1FRACVAL2_INIT
  PWMA->SM[1].FRACVAL2 = PWMA_SM1FRACVAL2_INIT;
#else
  PWMA->SM[1].FRACVAL2 = 0x0U;
#endif /* PWMA_SM1FRACVAL2_INIT */
#ifdef PWMA_SM1FRACVAL3_INIT
  PWMA->SM[1].FRACVAL3 = PWMA_SM1FRACVAL3_INIT;
#else
  PWMA->SM[1].FRACVAL3 = 0x0U;
#endif /* PWMA_SM1FRACVAL3_INIT */
#ifdef PWMA_SM1FRACVAL4_INIT
  PWMA->SM[1].FRACVAL4 = PWMA_SM1FRACVAL4_INIT;
#else
  PWMA->SM[1].FRACVAL4 = 0x0U;
#endif /* PWMA_SM1FRACVAL4_INIT */
#ifdef PWMA_SM1FRACVAL5_INIT
  PWMA->SM[1].FRACVAL5 = PWMA_SM1FRACVAL5_INIT;
#else
  PWMA->SM[1].FRACVAL5 = 0x0U;
#endif /* PWMA_SM1FRACVAL5_INIT */
#ifdef PWMA_SM1FRCTRL_INIT
  PWMA->SM[1].FRCTRL = PWMA_SM1FRCTRL_INIT;
#else
  PWMA->SM[1].FRCTRL = 0x0U;
#endif /* PWMA_SM1FRCTRL_INIT */
#endif /* (defined(PWMA_SM1_FRACTIONAL_BLOCK_AVAILABLE)) */
#ifdef PWMA_SM1OCTRL_INIT
  PWMA->SM[1].OCTRL = PWMA_SM1OCTRL_INIT;
#else
  PWMA->SM[1].OCTRL = 0x0U;
#endif /* PWMA_SM1OCTRL_INIT */
#ifdef PWMA_SM1STS_INIT
  PWMA->SM[1].STS = PWMA_SM1STS_INIT;
#else
  PWMA->SM[1].STS = 0x3fffU;
#endif /* PWMA_SM1STS_INIT */
#ifdef PWMA_SM1INTEN_INIT
  PWMA->SM[1].INTEN = PWMA_SM1INTEN_INIT;
#else
  PWMA->SM[1].INTEN = 0x0U;
#endif /* PWMA_SM1INTEN_INIT */
#ifdef PWMA_SM1DMAEN_INIT
  PWMA->SM[1].DMAEN = PWMA_SM1DMAEN_INIT;
#else
  PWMA->SM[1].DMAEN = 0x0U;
#endif /* PWMA_SM1DMAEN_INIT */
#ifdef PWMA_SM1TCTRL_INIT
  PWMA->SM[1].TCTRL = PWMA_SM1TCTRL_INIT;
#else
  PWMA->SM[1].TCTRL = 0x0U;
#endif /* PWMA_SM1TCTRL_INIT */
#ifdef PWMA_SM1DISMAP0_INIT
  PWMA->SM[1].DISMAP[0] = PWMA_SM1DISMAP0_INIT;
#else
  PWMA->SM[1].DISMAP[0] = 0xffffU;
#endif /* PWMA_SM1DISMAP0_INIT */
#ifdef PWMA_SM1DISMAP1_INIT
  PWMA->SM[1].DISMAP[1] = PWMA_SM1DISMAP1_INIT;
#else
  PWMA->SM[1].DISMAP[1] = 0xffffU;
#endif /* PWMA_SM1DISMAP1_INIT */
#ifdef PWMA_SM1DTCNT0_INIT
  PWMA->SM[1].DTCNT0 = PWMA_SM1DTCNT0_INIT;
#else
  PWMA->SM[1].DTCNT0 = 0x7ffU;
#endif /* PWMA_SM1DTCNT0_INIT */
#ifdef PWMA_SM1DTCNT1_INIT
  PWMA->SM[1].DTCNT1 = PWMA_SM1DTCNT1_INIT;
#else
  PWMA->SM[1].DTCNT1 = 0x7ffU;
#endif /* PWMA_SM1DTCNT1_INIT */
#ifdef PWM_CAPTCTRLA_EDGA0_MASK
#ifdef PWMA_SM1CAPTCTRLA_INIT
  PWMA->SM[1].CAPTCTRLA = PWMA_SM1CAPTCTRLA_INIT;
#else
  PWMA->SM[1].CAPTCTRLA = 0x0U;
#endif /* PWMA_SM1CAPTCTRLA_INIT */
#ifdef PWMA_SM1CAPTCOMPA_INIT
  PWMA->SM[1].CAPTCOMPA = PWMA_SM1CAPTCOMPA_INIT;
#else
  PWMA->SM[1].CAPTCOMPA = 0x0U;
#endif /* PWMA_SM1CAPTCOMPA_INIT */
#endif /* PWM_CAPTCTRLA_EDGA0_MASK */
#ifdef PWM_CAPTCTRLB_EDGB0_MASK
#ifdef PWMA_SM1CAPTCTRLB_INIT
  PWMA->SM[1].CAPTCTRLB = PWMA_SM1CAPTCTRLB_INIT;
#else
  PWMA->SM[1].CAPTCTRLB = 0x0U;
#endif /* PWMA_SM1CAPTCTRLB_INIT */
#ifdef PWMA_SM1CAPTCOMPB_INIT
  PWMA->SM[1].CAPTCOMPB = PWMA_SM1CAPTCOMPB_INIT;
#else
  PWMA->SM[1].CAPTCOMPB = 0x0U;
#endif /* PWMA_SM1CAPTCOMPB_INIT */
#endif /* PWM_CAPTCTRLB_EDGB0_MASK */
#ifdef PWM_CAPTCTRLX_EDGX0_MASK
#ifdef PWMA_SM1CAPTCTRLX_INIT
  PWMA->SM[1].CAPTCTRLX = PWMA_SM1CAPTCTRLX_INIT;
#else
  PWMA->SM[1].CAPTCTRLX = 0x0U;
#endif /* PWMA_SM1CAPTCTRLX_INIT */
#ifdef PWMA_SM1CAPTCOMPX_INIT
  PWMA->SM[1].CAPTCOMPX = PWMA_SM1CAPTCOMPX_INIT;
#else
  PWMA->SM[1].CAPTCOMPX = 0x0U;
#endif /* PWMA_SM1CAPTCOMPX_INIT */
#endif /* PWM_CAPTCTRLX_EDGX0_MASK */
#if (0 != 1)
#ifdef PWM_PHASEDLY_PHASEDLY_MASK
#ifdef PWMA_SM1PHASEDLY_INIT
  PWMA->SM[1].PHASEDLY = PWMA_SM1PHASEDLY_INIT;
#else
  PWMA->SM[1].PHASEDLY = 0x0U;
#endif /* PWMA_SM1PHASEDLY_INIT */
#endif /* PWM_PHASEDLY_PHASEDLY_MASK */
#endif /* (0 != 1) */
#if ((!defined(PWMA_SM1CTRL_INIT)) || (0U == (PWMA_SM1CTRL_INIT & PWM_CTRL_LDMOD_MASK)))
  PWMA->MCTRL |= PWM_MCTRL_LDOK(1U << 1);
#endif /* ((!defined(PWMA_SM1CTRL_INIT)) || (0U == (PWMA_SM1CTRL_INIT & PWM_CTRL_LDMOD_MASK))) */
/****************************************************************************/
/* Submodule 2 initialization */
/****************************************************************************/
  /* Disable the submodule and its output before the submodule init. */
  PWMA->OUTEN &= ~(PWM_OUTEN_PWMA_EN(1U << 2) | PWM_OUTEN_PWMB_EN(1U << 2) | PWM_OUTEN_PWMX_EN(1U << 2));
  PWMA->MCTRL &= ~(PWM_MCTRL_RUN(1U << 2) | PWM_MCTRL_CLDOK(1U << 2));
#ifdef PWMA_SM2CTRL_INIT
  PWMA->SM[2].CTRL = PWMA_SM2CTRL_INIT;
#else
  PWMA->SM[2].CTRL = 0x400U;
#endif /* PWMA_SM2CTRL_INIT */
#ifdef PWMA_SM2CTRL2_INIT
  PWMA->SM[2].CTRL2 = PWMA_SM2CTRL2_INIT;
#else
  PWMA->SM[2].CTRL2 = 0x0U;
#endif /* PWMA_SM2CTRL2_INIT */
#ifdef PWMA_SM2INIT_INIT
  PWMA->SM[2].INIT = PWMA_SM2INIT_INIT;
#else
  PWMA->SM[2].INIT = 0x0U;
#endif /* PWMA_SM2INIT_INIT */
#ifdef PWMA_SM2VAL0_INIT
  PWMA->SM[2].VAL0 = PWMA_SM2VAL0_INIT;
#else
  PWMA->SM[2].VAL0 = 0x0U;
#endif /* PWMA_SM2VAL0_INIT */
#ifdef PWMA_SM2VAL1_INIT
  PWMA->SM[2].VAL1 = PWMA_SM2VAL1_INIT;
#else
  PWMA->SM[2].VAL1 = 0x0U;
#endif /* PWMA_SM2VAL1_INIT */
#ifdef PWMA_SM2VAL2_INIT
  PWMA->SM[2].VAL2 = PWMA_SM2VAL2_INIT;
#else
  PWMA->SM[2].VAL2 = 0x0U;
#endif /* PWMA_SM2VAL2_INIT */
#ifdef PWMA_SM2VAL3_INIT
  PWMA->SM[2].VAL3 = PWMA_SM2VAL3_INIT;
#else
  PWMA->SM[2].VAL3 = 0x0U;
#endif /* PWMA_SM2VAL3_INIT */
#ifdef PWMA_SM2VAL4_INIT
  PWMA->SM[2].VAL4 = PWMA_SM2VAL4_INIT;
#else
  PWMA->SM[2].VAL4 = 0x0U;
#endif /* PWMA_SM2VAL4_INIT */
#ifdef PWMA_SM2VAL5_INIT
  PWMA->SM[2].VAL5 = PWMA_SM2VAL5_INIT;
#else
  PWMA->SM[2].VAL5 = 0x0U;
#endif /* PWMA_SM2VAL5_INIT */
#if (defined(PWMA_SM2_FRACTIONAL_BLOCK_AVAILABLE))
#ifdef PWMA_SM2FRACVAL1_INIT
  PWMA->SM[2].FRACVAL1 = PWMA_SM2FRACVAL1_INIT;
#else
  PWMA->SM[2].FRACVAL1 = 0x0U;
#endif /* PWMA_SM2FRACVAL1_INIT */
#ifdef PWMA_SM2FRACVAL2_INIT
  PWMA->SM[2].FRACVAL2 = PWMA_SM2FRACVAL2_INIT;
#else
  PWMA->SM[2].FRACVAL2 = 0x0U;
#endif /* PWMA_SM2FRACVAL2_INIT */
#ifdef PWMA_SM2FRACVAL3_INIT
  PWMA->SM[2].FRACVAL3 = PWMA_SM2FRACVAL3_INIT;
#else
  PWMA->SM[2].FRACVAL3 = 0x0U;
#endif /* PWMA_SM2FRACVAL3_INIT */
#ifdef PWMA_SM2FRACVAL4_INIT
  PWMA->SM[2].FRACVAL4 = PWMA_SM2FRACVAL4_INIT;
#else
  PWMA->SM[2].FRACVAL4 = 0x0U;
#endif /* PWMA_SM2FRACVAL4_INIT */
#ifdef PWMA_SM2FRACVAL5_INIT
  PWMA->SM[2].FRACVAL5 = PWMA_SM2FRACVAL5_INIT;
#else
  PWMA->SM[2].FRACVAL5 = 0x0U;
#endif /* PWMA_SM2FRACVAL5_INIT */
#ifdef PWMA_SM2FRCTRL_INIT
  PWMA->SM[2].FRCTRL = PWMA_SM2FRCTRL_INIT;
#else
  PWMA->SM[2].FRCTRL = 0x0U;
#endif /* PWMA_SM2FRCTRL_INIT */
#endif /* (defined(PWMA_SM2_FRACTIONAL_BLOCK_AVAILABLE)) */
#ifdef PWMA_SM2OCTRL_INIT
  PWMA->SM[2].OCTRL = PWMA_SM2OCTRL_INIT;
#else
  PWMA->SM[2].OCTRL = 0x0U;
#endif /* PWMA_SM2OCTRL_INIT */
#ifdef PWMA_SM2STS_INIT
  PWMA->SM[2].STS = PWMA_SM2STS_INIT;
#else
  PWMA->SM[2].STS = 0x3fffU;
#endif /* PWMA_SM2STS_INIT */
#ifdef PWMA_SM2INTEN_INIT
  PWMA->SM[2].INTEN = PWMA_SM2INTEN_INIT;
#else
  PWMA->SM[2].INTEN = 0x0U;
#endif /* PWMA_SM2INTEN_INIT */
#ifdef PWMA_SM2DMAEN_INIT
  PWMA->SM[2].DMAEN = PWMA_SM2DMAEN_INIT;
#else
  PWMA->SM[2].DMAEN = 0x0U;
#endif /* PWMA_SM2DMAEN_INIT */
#ifdef PWMA_SM2TCTRL_INIT
  PWMA->SM[2].TCTRL = PWMA_SM2TCTRL_INIT;
#else
  PWMA->SM[2].TCTRL = 0x0U;
#endif /* PWMA_SM2TCTRL_INIT */
#ifdef PWMA_SM2DISMAP0_INIT
  PWMA->SM[2].DISMAP[0] = PWMA_SM2DISMAP0_INIT;
#else
  PWMA->SM[2].DISMAP[0] = 0xffffU;
#endif /* PWMA_SM2DISMAP0_INIT */
#ifdef PWMA_SM2DISMAP1_INIT
  PWMA->SM[2].DISMAP[1] = PWMA_SM2DISMAP1_INIT;
#else
  PWMA->SM[2].DISMAP[1] = 0xffffU;
#endif /* PWMA_SM2DISMAP1_INIT */
#ifdef PWMA_SM2DTCNT0_INIT
  PWMA->SM[2].DTCNT0 = PWMA_SM2DTCNT0_INIT;
#else
  PWMA->SM[2].DTCNT0 = 0x7ffU;
#endif /* PWMA_SM2DTCNT0_INIT */
#ifdef PWMA_SM2DTCNT1_INIT
  PWMA->SM[2].DTCNT1 = PWMA_SM2DTCNT1_INIT;
#else
  PWMA->SM[2].DTCNT1 = 0x7ffU;
#endif /* PWMA_SM2DTCNT1_INIT */
#ifdef PWM_CAPTCTRLA_EDGA0_MASK
#ifdef PWMA_SM2CAPTCTRLA_INIT
  PWMA->SM[2].CAPTCTRLA = PWMA_SM2CAPTCTRLA_INIT;
#else
  PWMA->SM[2].CAPTCTRLA = 0x0U;
#endif /* PWMA_SM2CAPTCTRLA_INIT */
#ifdef PWMA_SM2CAPTCOMPA_INIT
  PWMA->SM[2].CAPTCOMPA = PWMA_SM2CAPTCOMPA_INIT;
#else
  PWMA->SM[2].CAPTCOMPA = 0x0U;
#endif /* PWMA_SM2CAPTCOMPA_INIT */
#endif /* PWM_CAPTCTRLA_EDGA0_MASK */
#ifdef PWM_CAPTCTRLB_EDGB0_MASK
#ifdef PWMA_SM2CAPTCTRLB_INIT
  PWMA->SM[2].CAPTCTRLB = PWMA_SM2CAPTCTRLB_INIT;
#else
  PWMA->SM[2].CAPTCTRLB = 0x0U;
#endif /* PWMA_SM2CAPTCTRLB_INIT */
#ifdef PWMA_SM2CAPTCOMPB_INIT
  PWMA->SM[2].CAPTCOMPB = PWMA_SM2CAPTCOMPB_INIT;
#else
  PWMA->SM[2].CAPTCOMPB = 0x0U;
#endif /* PWMA_SM2CAPTCOMPB_INIT */
#endif /* PWM_CAPTCTRLB_EDGB0_MASK */
#ifdef PWM_CAPTCTRLX_EDGX0_MASK
#ifdef PWMA_SM2CAPTCTRLX_INIT
  PWMA->SM[2].CAPTCTRLX = PWMA_SM2CAPTCTRLX_INIT;
#else
  PWMA->SM[2].CAPTCTRLX = 0x0U;
#endif /* PWMA_SM2CAPTCTRLX_INIT */
#ifdef PWMA_SM2CAPTCOMPX_INIT
  PWMA->SM[2].CAPTCOMPX = PWMA_SM2CAPTCOMPX_INIT;
#else
  PWMA->SM[2].CAPTCOMPX = 0x0U;
#endif /* PWMA_SM2CAPTCOMPX_INIT */
#endif /* PWM_CAPTCTRLX_EDGX0_MASK */
#if (0 != 2)
#ifdef PWM_PHASEDLY_PHASEDLY_MASK
#ifdef PWMA_SM2PHASEDLY_INIT
  PWMA->SM[2].PHASEDLY = PWMA_SM2PHASEDLY_INIT;
#else
  PWMA->SM[2].PHASEDLY = 0x0U;
#endif /* PWMA_SM2PHASEDLY_INIT */
#endif /* PWM_PHASEDLY_PHASEDLY_MASK */
#endif /* (0 != 2) */
#if ((!defined(PWMA_SM2CTRL_INIT)) || (0U == (PWMA_SM2CTRL_INIT & PWM_CTRL_LDMOD_MASK)))
  PWMA->MCTRL |= PWM_MCTRL_LDOK(1U << 2);
#endif /* ((!defined(PWMA_SM2CTRL_INIT)) || (0U == (PWMA_SM2CTRL_INIT & PWM_CTRL_LDMOD_MASK))) */
/****************************************************************************/
/* Submodule 0 initialization */
/****************************************************************************/
  /* Disable the submodule and its output before the submodule init. */
  PWMA->OUTEN &= ~(PWM_OUTEN_PWMA_EN(1U << 0) | PWM_OUTEN_PWMB_EN(1U << 0) | PWM_OUTEN_PWMX_EN(1U << 0));
  PWMA->MCTRL &= ~(PWM_MCTRL_RUN(1U << 0) | PWM_MCTRL_CLDOK(1U << 0));
#ifdef PWMA_SM0CTRL_INIT
  PWMA->SM[0].CTRL = PWMA_SM0CTRL_INIT;
#else
  PWMA->SM[0].CTRL = 0x400U;
#endif /* PWMA_SM0CTRL_INIT */
#ifdef PWMA_SM0CTRL2_INIT
  PWMA->SM[0].CTRL2 = PWMA_SM0CTRL2_INIT;
#else
  PWMA->SM[0].CTRL2 = 0x0U;
#endif /* PWMA_SM0CTRL2_INIT */
#ifdef PWMA_SM0INIT_INIT
  PWMA->SM[0].INIT = PWMA_SM0INIT_INIT;
#else
  PWMA->SM[0].INIT = 0x0U;
#endif /* PWMA_SM0INIT_INIT */
#ifdef PWMA_SM0VAL0_INIT
  PWMA->SM[0].VAL0 = PWMA_SM0VAL0_INIT;
#else
  PWMA->SM[0].VAL0 = 0x0U;
#endif /* PWMA_SM0VAL0_INIT */
#ifdef PWMA_SM0VAL1_INIT
  PWMA->SM[0].VAL1 = PWMA_SM0VAL1_INIT;
#else
  PWMA->SM[0].VAL1 = 0x0U;
#endif /* PWMA_SM0VAL1_INIT */
#ifdef PWMA_SM0VAL2_INIT
  PWMA->SM[0].VAL2 = PWMA_SM0VAL2_INIT;
#else
  PWMA->SM[0].VAL2 = 0x0U;
#endif /* PWMA_SM0VAL2_INIT */
#ifdef PWMA_SM0VAL3_INIT
  PWMA->SM[0].VAL3 = PWMA_SM0VAL3_INIT;
#else
  PWMA->SM[0].VAL3 = 0x0U;
#endif /* PWMA_SM0VAL3_INIT */
#ifdef PWMA_SM0VAL4_INIT
  PWMA->SM[0].VAL4 = PWMA_SM0VAL4_INIT;
#else
  PWMA->SM[0].VAL4 = 0x0U;
#endif /* PWMA_SM0VAL4_INIT */
#ifdef PWMA_SM0VAL5_INIT
  PWMA->SM[0].VAL5 = PWMA_SM0VAL5_INIT;
#else
  PWMA->SM[0].VAL5 = 0x0U;
#endif /* PWMA_SM0VAL5_INIT */
#if (defined(PWMA_SM0_FRACTIONAL_BLOCK_AVAILABLE))
#ifdef PWMA_SM0FRACVAL1_INIT
  PWMA->SM[0].FRACVAL1 = PWMA_SM0FRACVAL1_INIT;
#else
  PWMA->SM[0].FRACVAL1 = 0x0U;
#endif /* PWMA_SM0FRACVAL1_INIT */
#ifdef PWMA_SM0FRACVAL2_INIT
  PWMA->SM[0].FRACVAL2 = PWMA_SM0FRACVAL2_INIT;
#else
  PWMA->SM[0].FRACVAL2 = 0x0U;
#endif /* PWMA_SM0FRACVAL2_INIT */
#ifdef PWMA_SM0FRACVAL3_INIT
  PWMA->SM[0].FRACVAL3 = PWMA_SM0FRACVAL3_INIT;
#else
  PWMA->SM[0].FRACVAL3 = 0x0U;
#endif /* PWMA_SM0FRACVAL3_INIT */
#ifdef PWMA_SM0FRACVAL4_INIT
  PWMA->SM[0].FRACVAL4 = PWMA_SM0FRACVAL4_INIT;
#else
  PWMA->SM[0].FRACVAL4 = 0x0U;
#endif /* PWMA_SM0FRACVAL4_INIT */
#ifdef PWMA_SM0FRACVAL5_INIT
  PWMA->SM[0].FRACVAL5 = PWMA_SM0FRACVAL5_INIT;
#else
  PWMA->SM[0].FRACVAL5 = 0x0U;
#endif /* PWMA_SM0FRACVAL5_INIT */
#ifdef PWMA_SM0FRCTRL_INIT
  PWMA->SM[0].FRCTRL = PWMA_SM0FRCTRL_INIT;
#else
  PWMA->SM[0].FRCTRL = 0x0U;
#endif /* PWMA_SM0FRCTRL_INIT */
#endif /* (defined(PWMA_SM0_FRACTIONAL_BLOCK_AVAILABLE)) */
#ifdef PWMA_SM0OCTRL_INIT
  PWMA->SM[0].OCTRL = PWMA_SM0OCTRL_INIT;
#else
  PWMA->SM[0].OCTRL = 0x0U;
#endif /* PWMA_SM0OCTRL_INIT */
#ifdef PWMA_SM0STS_INIT
  PWMA->SM[0].STS = PWMA_SM0STS_INIT;
#else
  PWMA->SM[0].STS = 0x3fffU;
#endif /* PWMA_SM0STS_INIT */
#ifdef PWMA_SM0INTEN_INIT
  PWMA->SM[0].INTEN = PWMA_SM0INTEN_INIT;
#else
  PWMA->SM[0].INTEN = 0x0U;
#endif /* PWMA_SM0INTEN_INIT */
#ifdef PWMA_SM0DMAEN_INIT
  PWMA->SM[0].DMAEN = PWMA_SM0DMAEN_INIT;
#else
  PWMA->SM[0].DMAEN = 0x0U;
#endif /* PWMA_SM0DMAEN_INIT */
#ifdef PWMA_SM0TCTRL_INIT
  PWMA->SM[0].TCTRL = PWMA_SM0TCTRL_INIT;
#else
  PWMA->SM[0].TCTRL = 0x0U;
#endif /* PWMA_SM0TCTRL_INIT */
#ifdef PWMA_SM0DISMAP0_INIT
  PWMA->SM[0].DISMAP[0] = PWMA_SM0DISMAP0_INIT;
#else
  PWMA->SM[0].DISMAP[0] = 0xffffU;
#endif /* PWMA_SM0DISMAP0_INIT */
#ifdef PWMA_SM0DISMAP1_INIT
  PWMA->SM[0].DISMAP[1] = PWMA_SM0DISMAP1_INIT;
#else
  PWMA->SM[0].DISMAP[1] = 0xffffU;
#endif /* PWMA_SM0DISMAP1_INIT */
#ifdef PWMA_SM0DTCNT0_INIT
  PWMA->SM[0].DTCNT0 = PWMA_SM0DTCNT0_INIT;
#else
  PWMA->SM[0].DTCNT0 = 0x7ffU;
#endif /* PWMA_SM0DTCNT0_INIT */
#ifdef PWMA_SM0DTCNT1_INIT
  PWMA->SM[0].DTCNT1 = PWMA_SM0DTCNT1_INIT;
#else
  PWMA->SM[0].DTCNT1 = 0x7ffU;
#endif /* PWMA_SM0DTCNT1_INIT */
#ifdef PWM_CAPTCTRLA_EDGA0_MASK
#ifdef PWMA_SM0CAPTCTRLA_INIT
  PWMA->SM[0].CAPTCTRLA = PWMA_SM0CAPTCTRLA_INIT;
#else
  PWMA->SM[0].CAPTCTRLA = 0x0U;
#endif /* PWMA_SM0CAPTCTRLA_INIT */
#ifdef PWMA_SM0CAPTCOMPA_INIT
  PWMA->SM[0].CAPTCOMPA = PWMA_SM0CAPTCOMPA_INIT;
#else
  PWMA->SM[0].CAPTCOMPA = 0x0U;
#endif /* PWMA_SM0CAPTCOMPA_INIT */
#endif /* PWM_CAPTCTRLA_EDGA0_MASK */
#ifdef PWM_CAPTCTRLB_EDGB0_MASK
#ifdef PWMA_SM0CAPTCTRLB_INIT
  PWMA->SM[0].CAPTCTRLB = PWMA_SM0CAPTCTRLB_INIT;
#else
  PWMA->SM[0].CAPTCTRLB = 0x0U;
#endif /* PWMA_SM0CAPTCTRLB_INIT */
#ifdef PWMA_SM0CAPTCOMPB_INIT
  PWMA->SM[0].CAPTCOMPB = PWMA_SM0CAPTCOMPB_INIT;
#else
  PWMA->SM[0].CAPTCOMPB = 0x0U;
#endif /* PWMA_SM0CAPTCOMPB_INIT */
#endif /* PWM_CAPTCTRLB_EDGB0_MASK */
#ifdef PWM_CAPTCTRLX_EDGX0_MASK
#ifdef PWMA_SM0CAPTCTRLX_INIT
  PWMA->SM[0].CAPTCTRLX = PWMA_SM0CAPTCTRLX_INIT;
#else
  PWMA->SM[0].CAPTCTRLX = 0x0U;
#endif /* PWMA_SM0CAPTCTRLX_INIT */
#ifdef PWMA_SM0CAPTCOMPX_INIT
  PWMA->SM[0].CAPTCOMPX = PWMA_SM0CAPTCOMPX_INIT;
#else
  PWMA->SM[0].CAPTCOMPX = 0x0U;
#endif /* PWMA_SM0CAPTCOMPX_INIT */
#endif /* PWM_CAPTCTRLX_EDGX0_MASK */
#if (0 != 0)
#ifdef PWM_PHASEDLY_PHASEDLY_MASK
#ifdef PWMA_SM0PHASEDLY_INIT
  PWMA->SM[0].PHASEDLY = PWMA_SM0PHASEDLY_INIT;
#else
  PWMA->SM[0].PHASEDLY = 0x0U;
#endif /* PWMA_SM0PHASEDLY_INIT */
#endif /* PWM_PHASEDLY_PHASEDLY_MASK */
#endif /* (0 != 0) */
#if ((!defined(PWMA_SM0CTRL_INIT)) || (0U == (PWMA_SM0CTRL_INIT & PWM_CTRL_LDMOD_MASK)))
  PWMA->MCTRL |= PWM_MCTRL_LDOK(1U << 0);
#endif /* ((!defined(PWMA_SM0CTRL_INIT)) || (0U == (PWMA_SM0CTRL_INIT & PWM_CTRL_LDMOD_MASK))) */
/****************************************************************************/
/* Fault channel0 initialization */
/****************************************************************************/
  /* Fault setting are shared for all submodules, it is allowed to initiate it in each
     initialization function, but suggest to initiate it only once. */
#ifdef PWMA_FCTRL0_INIT
  PWMA->FAULT[0].FCTRL = PWMA_FCTRL0_INIT;
#else
  PWMA->FAULT[0].FCTRL = 0x0U;
#endif /* PWMA_FCTRL0_INIT */
#ifdef PWMA_FSTS0_INIT
  PWMA->FAULT[0].FSTS = PWMA_FSTS0_INIT;
#else
  PWMA->FAULT[0].FSTS = 0xfU;
#endif /* PWMA_FSTS0_INIT */
#ifdef PWMA_FFILT0_INIT
  PWMA->FAULT[0].FFILT = PWMA_FFILT0_INIT;
#else
  PWMA->FAULT[0].FFILT = 0x0U;
#endif /* PWMA_FFILT0_INIT */
#ifdef PWMA_FTST0_INIT
  PWMA->FAULT[0].FTST = PWMA_FTST0_INIT;
#else
  PWMA->FAULT[0].FTST = 0x0U;
#endif /* PWMA_FTST0_INIT */
#ifdef PWM_FCTRL2_NOCOMB_MASK
#ifdef PWMA_FCTRL20_INIT
  PWMA->FAULT[0].FCTRL2 = PWMA_FCTRL20_INIT;
#else
  PWMA->FAULT[0].FCTRL2 = 0x0U;
#endif /* PWMA_FCTRL20_INIT */
#endif /* PWM_FCTRL2_NOCOMB_MASK */

