nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f80000evk/demo_apps/mc_pmsm/pmsm_snsless/peripherals.c
/****************************************************************************/
/* Fault channel1 initialization */
/****************************************************************************/
  /* Fault setting are shared for all submodules, it is allowed to initiate it in each
     initialization function, but suggest to initiate it only once. */
#ifdef PWMA_FCTRL1_INIT
  PWMA->FAULT[1].FCTRL = PWMA_FCTRL1_INIT;
#else
  PWMA->FAULT[1].FCTRL = 0x0U;
#endif /* PWMA_FCTRL1_INIT */
#ifdef PWMA_FSTS1_INIT
  PWMA->FAULT[1].FSTS = PWMA_FSTS1_INIT;
#else
  PWMA->FAULT[1].FSTS = 0xfU;
#endif /* PWMA_FSTS1_INIT */
#ifdef PWMA_FFILT1_INIT
  PWMA->FAULT[1].FFILT = PWMA_FFILT1_INIT;
#else
  PWMA->FAULT[1].FFILT = 0x0U;
#endif /* PWMA_FFILT1_INIT */
#ifdef PWMA_FTST1_INIT
  PWMA->FAULT[1].FTST = PWMA_FTST1_INIT;
#else
  PWMA->FAULT[1].FTST = 0x0U;
#endif /* PWMA_FTST1_INIT */
#ifdef PWM_FCTRL2_NOCOMB_MASK
#ifdef PWMA_FCTRL21_INIT
  PWMA->FAULT[1].FCTRL2 = PWMA_FCTRL21_INIT;
#else
  PWMA->FAULT[1].FCTRL2 = 0x0U;
#endif /* PWMA_FCTRL21_INIT */
#endif /* PWM_FCTRL2_NOCOMB_MASK */

/****************************************************************************/
/* PWMA initialization */
/****************************************************************************/
#ifdef PWMA_OUTEN_INIT
  PWMA->OUTEN = (PWMA->OUTEN & (~PWMA_OUTEN_INIT_MASK)) | (PWMA_OUTEN_INIT & PWMA_OUTEN_INIT_MASK);
#endif /* PWMA_PWMA_OUTEN_INIT */
#ifdef PWMA_MASK_INIT
  PWMA->MASK = (PWMA->MASK & (~PWMA_MASK_INIT_MASK)) | (PWMA_MASK_INIT & PWMA_MASK_INIT_MASK);
#endif /* PWMA_PWMA_MASK_INIT */
#ifdef PWMA_SWCOUT_INIT
  PWMA->SWCOUT = (PWMA->SWCOUT & (~PWMA_SWCOUT_INIT_MASK)) | (PWMA_SWCOUT_INIT & PWMA_SWCOUT_INIT_MASK);
#endif /* PWMA_PWMA_SWCOUT_INIT */
#ifdef PWMA_DTSRCSEL_INIT
  PWMA->DTSRCSEL = (PWMA->DTSRCSEL & (~PWMA_DTSRCSEL_INIT_MASK)) | (PWMA_DTSRCSEL_INIT & PWMA_DTSRCSEL_INIT_MASK);
#endif /* PWMA_PWMA_DTSRCSEL_INIT */
#ifdef PWMA_MCTRL2_INIT
  PWMA->MCTRL2 = PWMA_MCTRL2_INIT;
#endif /* PWMA_PWMA_MCTRL2_INIT */
#ifdef PWMA_MCTRL_INIT
  PWMA->MCTRL = (PWMA->MCTRL & (~PWMA_MCTRL_INIT_MASK)) | (PWMA_MCTRL_INIT & PWMA_MCTRL_INIT_MASK);
#endif /* PWMA_PWMA_MCTRL_INIT */
#ifdef PWMA_SM0CTRL_INIT
#if ((!defined(PWMA_SM0CTRL2_INIT)) || (0U == (PWMA_SM0CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK)))
  PWMA->SM[0].CTRL2 |= PWM_CTRL2_FORCE(1U);
#endif /* ((!defined(PWMA_SM0CTRL2_INIT)) || (0U == (PWMA_SM0CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK))) */
#endif /* PWMA_SM0CTRL_INIT */
#ifdef PWMA_SM1CTRL_INIT
#if ((!defined(PWMA_SM1CTRL2_INIT)) || (0U == (PWMA_SM1CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK)))
  PWMA->SM[1].CTRL2 |= PWM_CTRL2_FORCE(1U);
#endif /* ((!defined(PWMA_SM1CTRL2_INIT)) || (0U == (PWMA_SM1CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK))) */
#endif /* PWMA_SM1CTRL_INIT */
#ifdef PWMA_SM2CTRL_INIT
#if ((!defined(PWMA_SM2CTRL2_INIT)) || (0U == (PWMA_SM2CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK)))
  PWMA->SM[2].CTRL2 |= PWM_CTRL2_FORCE(1U);
#endif /* ((!defined(PWMA_SM2CTRL2_INIT)) || (0U == (PWMA_SM2CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK))) */
#endif /* PWMA_SM2CTRL_INIT */
#ifdef PWMA_SM3CTRL_INIT
#if ((!defined(PWMA_SM3CTRL2_INIT)) || (0U == (PWMA_SM3CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK)))
  PWMA->SM[3].CTRL2 |= PWM_CTRL2_FORCE(1U);
#endif /* ((!defined(PWMA_SM3CTRL2_INIT)) || (0U == (PWMA_SM3CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK))) */
#endif /* PWMA_SM3CTRL_INIT */
}

/***********************************************************************************************************************
 * FreeMASTER initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'FreeMASTER'
- type: 'freemaster'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'freemaster_14894d49d87e02d0dca5f799e22554da'
- functional_group: 'BOARD_InitPeripherals'
- config_sets:
  - freemaster_config:
    - FMSTR_DISABLE: 'false'
    - initFreemaster: 'true'
    - generalConfig:
      - commInterface: 'serial'
      - interruptMode: 'polling'
      - initType: 'false'
      - serialConfig:
        - peripheralUART: 'QSCI0'
        - clockSource: 'genericUartClockSource'
        - clockSourceFreq: 'BOARD_BootClockRUN'
        - u32BaudRateBps: '115200'
        - parityMode_qsci: 'kQSCI_ParityDisabled'
        - dataBitCount_qsci: 'kQSCI_Data8Bit'
        - polarityMode_qsci: 'kQSCI_PolarityNormal'
        - enableUserInit: 'false'
        - user_init:
          - initFunctionID: 'SERIAL_communication_init'
        - enable_rx_irq: 'true'
        - interrupt_rx:
          - IRQn: 'kQSCI0_RCV_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - useDefaultISR: 'true'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
        - enable_tx_irq: 'true'
        - interrupt_tx:
          - IRQn: 'kQSCI0_TDRE_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - useDefaultISR: 'true'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
        - enable_err_irq: 'true'
        - interrupt_error:
          - IRQn: 'kQSCI0_RERR_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - useDefaultISR: 'true'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
        - enable_tridle_irq: 'true'
        - interrupt_tridle:
          - IRQn: 'kQSCI0_TRIDLE_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - useDefaultISR: 'true'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
        - quick_selection: 'QuickSelection1'
      - dsc_eonce_config:
        - txRegInterruptEnable: 'true'
        - tx_interrupt_vector:
          - IRQn: 'kTX_REG_VECTORn'
          - dsc_enable_interrrupt: ''
          - useDefaultISR: 'true'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
        - rxRegInterruptEnable: 'true'
        - rx_interrupt_vector:
          - IRQn: 'kRX_REG_VECTORn'
          - dsc_enable_interrrupt: ''
          - useDefaultISR: 'true'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
      - FMSTR_COMM_BUFFER_SIZE: 'autoSize'
      - FMSTR_COMM_RQUEUE_SIZE: '32'
      - FMSTR_USE_SCOPE: '2'
      - FMSTR_MAX_SCOPE_VARS: '8'
      - FMSTR_REC_FLOAT_TRIG: 'false'
      - recorders:
        - 0:
          - recID:
            - enableCustomID: 'false'
          - nameRec: 'Description of recorder 0'
          - recBuff:
            - customBuffer: 'false'
            - bufferAddress: 'FreeMASTER_RecBuffer0'
            - bufferExternDef: 'FMSTR_U8 FreeMASTER_RecBuffer0[1024]'
            - bufferSize: '1024'
          - basePeriod_ns: '100000'
          - recInit: 'true'
      - FMSTR_USE_TSA: 'false'
      - FMSTR_USE_TSA_INROM: 'true'
      - FMSTR_USE_TSA_SAFETY: 'true'
      - FMSTR_USE_TSA_DYNAMIC: 'false'
      - tsaBufferInit: 'false'
      - tsaBuff:
        - customBuffer: 'false'
        - bufferAddress: 'FreeMASTER_TSA_buffer'
        - bufferExternDef: 'FMSTR_ADDR FreeMASTER_TSA_buffer[TSA_TABLE_SIZE]'
        - bufferSize: '(5 * sizeof(FMSTR_TSA_ENTRY))'
      - pipes: []
      - FMSTR_USE_READMEM: 'true'
      - FMSTR_USE_WRITEMEM: 'true'
      - FMSTR_USE_WRITEMEMMASK: 'true'
      - passR: ''
      - passRW: ''
      - passRWF: ''
      - FMSTR_USE_HASHED_PASSWORDS: 'false'
      - FMSTR_USE_APPCMD: 'false'
      - FMSTR_APPCMD_BUFF_SIZE: '32'
      - FMSTR_MAX_APPCMD_CALLS: '8'
      - FMSTR_DEBUG_LEVEL: '0'
      - FMSTR_DEBUG_PRINTF: 'debug_console'
      - FMSTR_DEBUG_TX: 'false'
      - FMSTR_CUSTOM_INCLUDES: ''
      - FMSTR_CUSTOM_OPTIONS: ''
    - freemaster_codegenerator: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */
/* QSCI configuration structure */
qsci_config_t FreeMASTER_serial_config;
/* Recorder0 configuration */
FMSTR_U8 FreeMASTER_RecBuffer0[FREEMASTER_REC_0_SIZE];
FMSTR_REC_BUFF FreeMASTER_Recorder_0 = {
  .name = "Description of recorder 0",
  .addr = (FMSTR_ADDR)FreeMASTER_RecBuffer0,
  .size = (FMSTR_SIZE) sizeof(FreeMASTER_RecBuffer0),
  .basePeriod_ns = 100000UL
};

static void FreeMASTER_init(void) {
  /* Serial communication peripheral initialization */

  /* Get QSCI default configuration and modify it */
  QSCI_GetDefaultConfig(&FreeMASTER_serial_config, FREEMASTER_SERIAL_PERIPHERAL_BAUDRATE, FREEMASTER_SERIAL_PERIPHERAL_CLK_FREQ);

  FreeMASTER_serial_config.eParityMode = kQSCI_ParityDisabled;
  FreeMASTER_serial_config.eDataBitMode = kQSCI_Data8Bit;
  FreeMASTER_serial_config.ePolarityMode = kQSCI_PolarityNormal;

